# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'caskroom/drivers'

tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/services'

tap 'linode/cli'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

brew 'autoconf'
brew 'automake'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'ag'
brew 'awscli'
brew 'curl', args: ['with-openssl']
brew 'fzf'
brew 'git'
brew 'git-extras'
brew 'git-flow'
brew 'graphviz'
brew 'heroku'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'tree'
brew 'wget'

# Libs
brew 'pixman'
brew 'openssl'
brew 'gdbm'
brew 'dialog'
brew 'jpeg'
brew 'pcre2'
brew 'icu4c'
brew 'pango'
brew 'pangomm'
brew 'fontforge', args: ['with-giflib', 'with-libspiro']
brew 'gnupg'
brew 'gsl'
brew 'gtk+'
brew 'gtkmm'
brew 'gd'
brew 'gdk-pixbuf'
brew 'ghostscript'
brew 'jq'
brew 'libatomic_ops'
brew 'libgit2'
brew 'libiconv'
brew 'libsodium'
brew 'libspiro'
brew 'libssh2'
brew 'libxml2'
brew 'libxslt'
brew 'libyaml'
brew 'libpq'
brew 'pandoc'
brew 'pidof'
brew 'qt'
brew 'readline'
brew 'scons'
brew 'sl'
brew 'swig'
brew 'unixodbc'
brew 'unrar'
brew 'w3m'
brew 'zlib'

# Development
brew 'terminal-notifier'
brew 'tmux'
brew 'elixir'
brew 'go'
brew 'rbenv'
brew 'ruby-build'
brew 'nvm'

brew 'yarn'
brew 'nginx'

brew 'phantomjs'
brew 'casperjs'
brew 'cmake'
brew 'cscope'
brew 'ctags'

# Data stores
brew 'elasticsearch'
brew 'mongodb'
brew 'sqlite3'
brew 'mysql', restart_service: true
brew 'redis', restart_service: true
brew 'postgresql', restart_service: true
brew 'pgcli'

# Apps
cask 'aerial'
cask 'alfred'
cask 'android-platform-tools'
cask 'caffeine'
# cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'gitup'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpgtools'
cask 'insomnia'
cask 'iterm2'
cask 'java'
cask 'limechat'
cask 'macdown'
cask 'psequel'
# cask 'quip'
cask 'sequel-pro'
cask 'shuttle'
cask 'slack'
cask 'spotify'
cask 'keepassxc'
cask 'sublime-text'
cask 'transmit'
# cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'workflowy'
cask 'zoomus'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'caskroom/fonts/font-source-code-pro-for-powerline'
cask 'caskroom/fonts/font-source-code-pro'
cask 'caskroom/fonts/font-source-sans-pro'
cask 'caskroom/fonts/font-source-serif-pro'
cask 'caskroom/fonts/font-consolas-for-powerline'
cask 'caskroom/fonts/font-inconsolata'
cask 'caskroom/fonts/font-inconsolata-for-powerline'
cask 'caskroom/fonts/font-roboto-mono'
cask 'caskroom/fonts/font-roboto-mono-for-powerline'
cask 'caskroom/fonts/font-hack-nerd-font'

# Fun
brew 'cowsay'
brew 'fortune'
brew 'lolcat'
